{
    "version": "https://jsonfeed.org/version/1",
    "title": "Vedanta",
    "description": "",
    "home_page_url": "https://advaitavedanta.github.io",
    "feed_url": "https://advaitavedanta.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "Seeker"
    },
    "items": [
        {
            "id": "https://advaitavedanta.github.io/adhyasa.html",
            "url": "https://advaitavedanta.github.io/adhyasa.html",
            "title": "adhyAsa",
            "summary": "All these mistakes are called adhyasa or superimposition. Shankara explains it simply as atasmin tadbuddhi - \"thinking 'this thing' is 'that thing' when it's not 'that thing at all'... Or, seeing something completely different in a locus where some thing else is present\".\" For example,&hellip;",
            "content_html": "<p>All these mistakes are called adhyasa or superimposition.</p>\n<p>Shankara explains it simply as <span style=\"text-decoration: underline;\"><em>atasmin tadbuddhi </em></span>-  \"thinking 'this thing' is 'that thing' when it's not 'that thing at all'...</p>\n<p>Or, seeing something completely different in a locus where some thing else is present\".\"</p>\n<p>For example, when we see someone's short body and say \"I am short,\" we're putting the body's quality onto ourselves.</p>\n<p>Also, when we say \"I am happy or sad,\" we're putting the mind's feelings onto ourselves. That's called <strong>dharma adhyasa</strong>.</p>\n<p>Imagine two people with similar noses; we might think one person's qualities belong to the other, even without knowing them. That's dharmi adhyasa. (the thief superimposed on the pillar).</p>\n<p>Then there's <strong>shobhana adhyasa</strong>,  means superimposition of beauty or goodness over some thing. According to this concept, before we ever like or try to have an object, this is what we do. Unknown to ourselves- we discover some reason, a good reason, for us to have or enjoy or to be associated with that object. The physical manifestation of this can be observed in all walks of life. Each of us consciously or unconsciously tries to improve one’s appeal by becoming more beautiful/ handsome. Empirical studies carried out indifferent countries, across different cultures/ societies have mostly led to following observations: </p>\n<ul>\n<li>Products and services sell better if famous people endorse them.</li>\n<li>Lots of ads use images of beautiful or strong people to make products seem more appealing.</li>\n<li>Women often do well in jobs where they have to talk to people or sell things.</li>\n<li>Good-looking people sometimes get treated better in schools or at work, even if they're not doing anything special.</li>\n<li>And sometimes, good-looking kids might get into less trouble for the same mistakes at home or school.</li>\n</ul>\n<p>There's <strong>gnyana adhyasa</strong>, like mistaking the sunrise for the sun moving.<br>There's arthAdhyAsa, like mistaking a rope for a snake.</p>\n<p>All these are mistakes. When we understand what's really going on, the mistakes disappear, and we see things as they are.<br><br><strong>kAryAdhyAsa </strong>and <strong>kAraNAdhyAsa </strong>-  The superimposition of primal ignorance<br>which is jagat upAdAna kAraNa on brahman is <strong>kAraNAdhyAsa</strong>.<br>The superimposition of the world on Brahman due to that primal ignorance is<br><strong>kAryAdhyAsa</strong>.</p>\n<p><strong>svarUpAdhyAsa </strong>and <strong>samsargAdhyAsa</strong>- the superimposition of the svarUpa /<br>the thing-itself on another (a snake on a rope) is <strong><em>svarUpAdhyAsa</em></strong>, whereas the superimposition of the attributes of a thing on another is <strong>samsargAdhyAsa </strong>eg, the redness of a flower superimposed on crystal.<br><br><strong>nirupAdhika </strong>and <strong>sopAdhika, </strong>adhyAsa involve the presence or absence of an \"upAdhi,\" which transfers its attributes to something nearby. In <strong>nirupAdhika </strong>adhyAsa, the substratum (like a rope) is misunderstood or not clearly perceived, leading to mistaken identities (like mistaking the rope for a snake). This misconception disappears with the knowledge of the substratum. <br>In <strong>sopAdhika </strong>adhyAsa, an upAdhi (like a nearby flower) is present, causing the mistaken perception (like seeing a crystal as red). Even if we know the crystal is colorless, as long as the flower is nearby, the mistaken perception persists.<br><br><br></p>\n<p>In Vedanta, understanding mostly involves gnyana adhyasa. We're in the dark about things, so knowledge is the light.</p>",
            "author": {
                "name": "Seeker"
            },
            "tags": [
            ],
            "date_published": "2024-04-21T19:37:36+05:30",
            "date_modified": "2024-04-21T20:34:06+05:30"
        },
        {
            "id": "https://advaitavedanta.github.io/adhyaropa-apavada-nyaya.html",
            "url": "https://advaitavedanta.github.io/adhyaropa-apavada-nyaya.html",
            "title": "adhyAropa apavAda nyAya",
            "summary": "adhyAropa refers to the declaration of real differences among the creator, the creation, and the individual selves. apavAda , on the other hand, involves the negation of these differences. Initially, the teaching emphasizes duality, acknowledging the everyday experience of separateness. This stage is akin to teaching a&hellip;",
            "content_html": "<p>adhyAropa refers to the declaration of real differences among the creator, the creation, and the individual selves.</p>\n<p>apavAda , on the other hand, involves the negation of these differences.</p>\n<p>Initially, the teaching emphasizes duality, acknowledging the everyday experience of separateness. This stage is akin to teaching a child the alphabet before introducing complex literature.</p>\n<p>As the seeker progresses, the scripture gradually reveals that the individual selves are not separate entities from the divine but are inseparable parts of it. This process of negation begins even without the seeker consciously realizing it.</p>\n<p>During these stages, the scripture encourages the pursuit of righteousness, wealth, and desires, as mentioned in yesterday's discussion.</p>\n<p>Once the student has developed strong reasoning skills, their mind becomes receptive like fertile soil awaiting seeds. Spiritual knowledge (Sravana, Manana, and Nididhyasana) is present in significant measure.</p>\n<p>At this juncture, the scripture begins guiding the seeker towards the teachings of liberation. The examination of the worlds becomes increasingly relevant, leading to the gradual revelation of the meaning of the mahAvAkyAs. These teachings unveil the truth that there is no creator other than the Self, no creation other than the Self, and no individual selves other than the Self.</p>\n<p>Vedanta expounds the Mahavakyas through various methods, such as the <strong><em>Eka vignyAnEna sarva vignyAna prakriyA</em></strong> by chAndogya , the <strong>Pancha Kosha</strong> (five sheaths) prakriya in the Taittiriya Upanishad, and the <strong>kArya-kArana (cause-effect) prakriya </strong>found in many Upanishads. The pinnacle of these teachings lies in the Mandukya Upanishad's exposition of the<strong> avastha traya prakriya</strong> and the <strong>shariira traya prakriya.</strong></p>\n<p>All of these teachings rely on the prakriya of adhyAropa-apavAda, sometimes referred to as the method of superimposition and negation (adhyAropa apavAda nyAya)</p>\n<p>Indeed, this method represents the aspiration of every teacher and Upanishad—to guide seekers from the realm of apparent duality to the realization of ultimate non-duality.</p>",
            "author": {
                "name": "Seeker"
            },
            "tags": [
            ],
            "date_published": "2024-04-21T19:26:52+05:30",
            "date_modified": "2024-04-21T19:38:03+05:30"
        },
        {
            "id": "https://advaitavedanta.github.io/the-six-indicators-for-vedic-analysis-shadlingam.html",
            "url": "https://advaitavedanta.github.io/the-six-indicators-for-vedic-analysis-shadlingam.html",
            "title": "The Six Indicators for Vedic Analysis – Shadlingam",
            "summary": "Determining the main idea behind Vedic or Upanishadic teachings isn't as straightforward as it may seem. The scriptures have a unique way of testing and sometimes seeming to mislead readers. For instance, the same word in different contexts can signify various meanings. \"AkAsha\" could refer&hellip;",
            "content_html": "<p>Determining the main idea behind Vedic or Upanishadic teachings isn't as straightforward as it may seem. The scriptures have a unique way of testing and sometimes seeming to mislead readers. For instance, the same word in different contexts can signify various meanings. \"AkAsha\" could refer to subtle space, gross space, or chaitanya brahman. Those who teach these Upanishadic principles need to grasp at least a basic understanding of six indicators. And as seekers, it's crucial to handle the words of the scriptures and our teachers with the utmost care and reverence they deserve. <br><br></p>\n<ol>\n<li>\n<p><strong>upakrama and upasamhAra:</strong> These indicate the introductory and concluding statements of a topic. In modern presentations, it's like stating something at the beginning, explaining it, and reiterating it at the end. If a statement appears both at the beginning and the end of an Upanishad section, it signifies the primary meaning of the topic.<br>For instance, the Chandogya Upanishad chapter six starts with the grand declaration (mahA pratijnA) that -<br>\"if a given statement is mentioned in the beginning of an upaniShad and in its ending, then that is the primary meaning of the topic.\".<br>This is the upkrama indicator. Similarly, it concludes with the father uddhAlaka AruNee to his son shvEtakEtu is “that AtmA alone is.. That AtmA alone is satyam.. That AtmA Thou Art, shvEtakEu” .<br>And this is upasamhAram and thus we understand the advaitam is the central teaching of chAndogya Upanishad.</p>\n</li>\n<li>\n<p><strong>abhyAsa:</strong> This refers to repetition. In a given topic, a point that is <strong>REPEATEDLY MENTIONED </strong>is the central theme of that topic.  In chAndogya Upanishad, in the end, the son asks the father NINE times to teach him about bramhan or AtmA again and again.. Then the father ALSO gives NINE different examples to drive home the truth of advaitam into the buddhi of the totally eager, attentive and respectful son. This repetition shows that the central teaching of chAndogya Upanishad is advaitam ONLY.</p>\n</li>\n<li>\n<p><strong>apoorvata:</strong> It points to uniqueness, something not mentioned before. In the Chandogya Upanishad, when the father reveals to his son, Shvetaketu, \"You are That Brahman,\" it unveils a unique understanding previously unknown to Shvetaketu, akin to most of us new to Vedanta, and this unique mahAvAkya we understand to be the central teaching of chAndogya Upanishad.</p>\n</li>\n<li>\n<p><strong>phalam:</strong> This means “what is the USE of even studying this upanishad?” In chAndogya Upanishad, the father tells him that “you know one thing called bramhan, then you AS IF know everything.. and knowing that you end samsara, which is nothing but another name for sorrow”  So shvEtakEtu understands that there is a PREVIOUSLY UNKOWN ADVANTAGE for understanding bramhan.  That is the fruit of advaita vedAntic study mentioned in chAndogya Upanishad </p>\n</li>\n<li>\n<p><strong>arthavAda:</strong> phalam means “what is the USE of even studying this upanishad?” In chAndogya Upanishad, the father tells him that “you know one thing called bramhan, then you AS IF know everything.. and knowing that you end samsara, which is nothing but another name for sorrow”  So shvEtakEtu understands that there is a PREVIOUSLY UNKOWN ADVANTAGE for understanding bramhan.  That is the fruit of advaita vedAntic study mentioned in chAndogya Upanishad </p>\n</li>\n<li>\n<p><strong>upapatti:</strong>  upapatti means LOGIC. chAndogya Upanishad uses several examples to teach shvEtakEtu. An example means logic.  Because every example has a PURPOSE which can not be directly imbibed, but only by an less powerful example than the intrinsic truth.  THIS IS NOT A DEFICIENCY OF USING AN EXAMPLE, BUT ACTUALLY THE PURPOSE OF USING AN EXAMPLE TO UNDERSTAND SOMETHING LOFTIER.  <br>When we say  9 = 9, is not an example, because there is NOTHING conveyed by such an equation.  And if we say 9 = 8, it is called apadruShTaanta or incorrect example because they can not be equated at all.  <br><em>But if the teacher says </em>5+4 = 10-1, <em>then the example becomes</em> <em><strong>ALIVE</strong></em>. The terms on the left side appear to be different from the terms on the right side. The plus and minus symbols are different.  STILL THEY ARE EQUATED.  Similarly, tat tvam asi being the mahAvAkya advaita upadEsha of chAndogya Upanishad, we do not understand how this miserable jiva can be THAT bramhan?  shvEtakEtu that is why askes repeatedly to be taught, and every example used by the father to teach his son convinces the student that what the father is teaching HAS TO BE CORRECT.<br><br><br>Thus these six lingas are used in chAndogya Upanishad and it is a complete Upanishad.  However, just because other Upanishads do not use all the six indicators, it does not mean that they are less in value compared to chAndogya Upanishad.  AN UPANISHAD IS GIVEN THAT NAME ONLY BECAUSE IT EXPOUNDS THE MAHAVAKYA, WHICH IS JEEVA BRAMHA ONENESS.  Other Upanishads may use any number of these indicators, but they will always be focused on mahavakya upadesha.</p>\n</li>\n</ol>",
            "author": {
                "name": "Seeker"
            },
            "tags": [
            ],
            "date_published": "2024-04-21T19:15:51+05:30",
            "date_modified": "2024-04-21T19:15:51+05:30"
        }
    ]
}
