{
    "version": "https://jsonfeed.org/version/1",
    "title": "Vedanta",
    "description": "",
    "home_page_url": "https://advaitavedanta.github.io",
    "feed_url": "https://advaitavedanta.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "Seeker"
    },
    "items": [
        {
            "id": "https://advaitavedanta.github.io/nature-of-ignorance-avidya.html",
            "url": "https://advaitavedanta.github.io/nature-of-ignorance-avidya.html",
            "title": "Nature of Ignorance / Avidya",
            "summary": "ज्ञानेन तु तदज्ञानं येषां नाशितमात्मनः। तेषामादित्यवज्ज्ञानं प्रकाशयति तत्परम् ।।5.16।। Ignorance, or \"agyaan,\" isn't simply the absence of knowledge but rather its adversary. It persists until displaced by knowledge. Agyaan shouldn't be misconstrued as a lack of knowledge because mere absence (\"abhaava\") doesn't lead to issues.",
            "content_html": "<p>ज्ञानेन तु तदज्ञानं येषां नाशितमात्मनः। तेषामादित्यवज्ज्ञानं प्रकाशयति तत्परम् ।।5.16।।<br><br>Ignorance, or \"agyaan,\" isn't simply the absence of knowledge but rather its adversary. It persists until displaced by knowledge. Agyaan shouldn't be misconstrued as a lack of knowledge because mere absence (\"abhaava\") doesn't lead to issues. Problems arise from presence, or \"bhaava,\" not absence. Thus, agyaan isn't the absence of knowledge, or \"gyaan abhaava.\" Ignorance opposes knowledge and, being problematic, holds significance as long as it persists. However, in the presence of knowledge, it ceases to exist.</p>\n<p>Similarly to how darkness dissipates in the presence of light, ignorance vanishes in the presence of knowledge. Ignorance has a tangible existence, or \"bhaava,\" causing errors and troubles. For instance, mistaking a rope for a snake due to ignorance induces fear. Likewise, in dreams, ignorance about the true self leads to perplexing scenarios, such as a millionaire dreaming of being a beggar and vice versa.</p>\n<p>Ignorance is dispelled by knowledge specific to the subject. Just as knowledge about a pot dispels ignorance about it, understanding the true nature of the self eradicates self-ignorance.</p>\n<p>This realization occurs in the minds of those previously ignorant. Krishna likens this transformative knowledge to the rising sun. Just as the sun dispels darkness and illuminates everything around, self-knowledge eradicates self-ignorance and reveals the self as Brahman—a truth previously unknown.</p>\n<p>Understanding the analogy between knowledge and the sun is crucial. Knowledge doesn't illuminate the self for viewing; rather, it dispels ignorance and unveils the inherent truth—the self itself is the light. This knowledge, known as vritti-gyaana, arises as the thought \"I am Brahman - aham brahma asmi\" in the mind. This thought signifies the knowledge that eradicates self-ignorance, revealing the truth about the self being Brahman. \"I am Brahman\" represents the ultimate truth, or tattva, recognized through teachings from scripture.</p>",
            "author": {
                "name": "Seeker"
            },
            "tags": [
            ],
            "date_published": "2024-04-28T02:09:30+05:30",
            "date_modified": "2024-04-28T02:09:30+05:30"
        },
        {
            "id": "https://advaitavedanta.github.io/action-in-inaction-and-inaction-in-action-bg-418.html",
            "url": "https://advaitavedanta.github.io/action-in-inaction-and-inaction-in-action-bg-418.html",
            "title": "Action in Inaction &amp; Inaction in Action (BG 4.18)",
            "summary": "कर्मण्यकर्म यः पश्येदकर्मणि च कर्म यः। स बुद्धिमान् मनुष्येषु स युक्तः कृत्स्नकर्मकृत्।। ahankAra is never free from karma &amp; atma is ever free from karma. In the action which is falsely transferred on ātmā, upon that falsely transferred action, wise man sees inaction. ( ātmani&hellip;",
            "content_html": "<p>कर्मण्यकर्म यः पश्येदकर्मणि च कर्म यः। स बुद्धिमान् मनुष्येषु स युक्तः कृत्स्नकर्मकृत्।।<br><br>ahankAra is never free from karma &amp; atma is ever free from karma. In the action which is falsely transferred on ātmā, upon that falsely transferred action, wise man sees inaction.  ( ātmani adhyastham-karma )<br><br>Actionlessness is two fold - </p>\n<p>1 - One is the absolute actionlessness which belongs to the ātmā. As far as the lay people are concerned the absolute actionlessness is not at all  nown because they don’t now the ātmā. As far as the lay people are concerned the absolute actionlessness is not at all  nown because they don’t  now the ātmā. </p>\n<p>2 - Then there is a second actionlessness which is the empirical actionlessness (it is anitya). Empirical akarma is as good as karma for all practical purposes. The empirical actionlessness  for  all  practical  purposes  can  be  equated  with karma because these two have got several common features, sādharmyam. Sādharmyam means common features.<br>Example - You never do the action of fasting, it is abstaining from eating and it is non-eating akarma which is presented as though another karma (when you say I did the fasting). <br>akarma is a type of  arma only because of five reasons. <br><br>- kAraka-sAdhyatvat<br>- prayatna-sAdhyatvat<br>- bahu-vidhatvAt<br>- punyapApa-janakatvAt<br>- chaudana vishayatvAt (shastric instructions)<br><br>kriyate iti karma. kriyate iti means vyApAra mAtram. <br><br>Sarpē-rajjum paśyati means he sees rope in snake, in the place of snake a wise person sees the rope. Therefore karmaṇi means in the place of action wise  person  sees inaction. </p>",
            "author": {
                "name": "Seeker"
            },
            "tags": [
            ],
            "date_published": "2024-04-23T23:10:10+05:30",
            "date_modified": "2024-04-23T23:10:53+05:30"
        },
        {
            "id": "https://advaitavedanta.github.io/na-asato-vidyate-bhavo.html",
            "url": "https://advaitavedanta.github.io/na-asato-vidyate-bhavo.html",
            "title": "Na asato vidyate bhavo",
            "summary": "Perception of Darkness: Na asato vidyate bhavo: Invariable and Variable Existence: Attributive Existence: Conclusion: Existence is not a property of objects but an independent principle pervading them. It transcends the boundaries of objects and continues to exist beyond their dissolution. Pure existence, unaffected by the&hellip;",
            "content_html": "<div class=\"flex-1 overflow-hidden\">\n<div class=\"react-scroll-to-bottom--css-iystm-79elbk h-full\">\n<div class=\"react-scroll-to-bottom--css-iystm-1n7m0yu\">\n<div>\n<div class=\"flex flex-col text-sm pb-9\">\n<div class=\"w-full text-token-text-primary\" dir=\"auto\" data-testid=\"conversation-turn-43\">\n<div class=\"px-4 py-2 justify-center text-base md:gap-6 m-auto\">\n<div class=\"flex flex-1 text-base mx-auto gap-3 juice:gap-4 juice:md:gap-6 md:px-5 lg:px-1 xl:px-5 md:max-w-3xl lg:max-w-[40rem] xl:max-w-[48rem]\">\n<div class=\"relative flex w-full flex-col agent-turn\">\n<div class=\"flex-col gap-1 md:gap-3\">\n<div class=\"flex flex-grow flex-col max-w-full\">\n<div class=\"min-h-[20px] text-message flex flex-col items-start gap-3 whitespace-pre-wrap break-words [.text-message+&amp;]:mt-5 overflow-x-auto\" dir=\"auto\" data-message-author-role=\"assistant\" data-message-id=\"06f4bd27-7758-4a3f-9923-c45f5a1ad291\">\n<div class=\"markdown prose w-full break-words dark:prose-invert light\">\n<p><strong>Perception of Darkness:</strong></p>\n<ul>\n<li>Darkness is defined as that which obstructs the function of the eyes, according to shashtras.</li>\n<li>Since darkness hinders the eyesight, we do not perceive objects in darkness.</li>\n<li>In Sanskrit, darkness is termed \"andhakāra,\" meaning the factor that makes the eyes blind.</li>\n<li>Consequently, when we claim to experience darkness, we are actually experiencing the blindness caused by darkness, not darkness itself.</li>\n</ul>\n<p><strong>Na asato vidyate bhavo:</strong></p>\n<ul>\n<li>Object and existence are often experienced together, leading us to perceive them as one entity.</li>\n<li>This misunderstanding arises due to \"sāmānādhikaraṇyam,\" where both object (mithyā) and existence (satyam) are experienced simultaneously.</li>\n<li>An example is provided where the experience of a hand is treated as a single entity, although it comprises both the hand (object) and the light falling on it (existence).</li>\n<li>This composite experience results in overlooking the distinction between object and existence.</li>\n</ul>\n<p><strong>Invariable and Variable Existence:</strong></p>\n<ul>\n<li>Object experience varies, indicating the variability of the object itself, termed \"asat\" or unreal.</li>\n<li>Conversely, existence experience remains constant, implying the invariable nature of existence, termed \"sat\" or real.</li>\n<li>The object's variability is demonstrated through changes in perception, while existence remains consistent despite changes in objects.</li>\n<li>Even in the absence of objects, existence persists, demonstrating its invariability and reality.</li>\n</ul>\n<p><strong>Attributive Existence:</strong></p>\n<ul>\n<li>Existence experienced is attributed to objects and is always associated with them.</li>\n<li>When objects cease to exist, the attributive existence shifts to other objects, maintaining its continuity.</li>\n<li>The pure existence, not dependent on objects, remains unmanifest and cannot be directly experienced.</li>\n<li>The presence of existence is constant, whether manifest or unmanifest, leading to the recognition of its eternal nature, termed \"satyam.\"</li>\n</ul>\n<p><strong>Conclusion:</strong></p>\n<ul>\n<li>Existence is not a property of objects but an independent principle pervading them.</li>\n<li>It transcends the boundaries of objects and continues to exist beyond their dissolution.</li>\n<li>Pure existence, unaffected by the presence or absence of objects, is termed \"brahman\" and recognized as \"satyam\" due to its inherent and unchanging nature.</li>\n</ul>\n</div>\n</div>\n</div>\n<div class=\"mt-1 flex gap-3 empty:hidden\"> </div>\n<div class=\"pr-2 lg:pr-0\"> </div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<div class=\"w-full pt-2 md:pt-0 dark:border-white/20 md:border-transparent md:dark:border-transparent md:w-[calc(100%-.5rem)]\"><form class=\"stretch mx-2 flex flex-row gap-3 last:mb-2 md:mx-4 md:last:mb-6 lg:mx-auto lg:max-w-2xl xl:max-w-3xl\">\n<div class=\"relative flex h-full flex-1 flex-col\">\n<div class=\"absolute bottom-full left-0 right-0\"> </div>\n<div class=\"flex w-full items-center\"> </div>\n</div>\n</form></div>",
            "author": {
                "name": "Seeker"
            },
            "tags": [
            ],
            "date_published": "2024-04-21T21:25:31+05:30",
            "date_modified": "2024-04-21T21:27:58+05:30"
        },
        {
            "id": "https://advaitavedanta.github.io/swabhavik-agantuk-guna.html",
            "url": "https://advaitavedanta.github.io/swabhavik-agantuk-guna.html",
            "title": "Swabhavik / Agantuk Guna",
            "summary": "The concept of \"guna\" refers to attributes or qualities that are inherent in objects or beings. These gunas can be categorized into two main types: Swabhavik Guna (Intrinsic Properties): Agantuk Guna (Transient or Acquired Properties): Agantuk guna refers to temporary or acquired properties that are&hellip;",
            "content_html": "<p>The concept of \"guna\" refers to attributes or qualities that are inherent in objects or beings. These gunas can be categorized into two main types:</p>\n<ol>\n<li>\n<p><strong>Swabhavik Guna (Intrinsic Properties)</strong>:</p>\n<ul>\n<li>Swabhavik guna refers to inherent or intrinsic properties that are natural or essential to an object's existence.</li>\n<li>These qualities are fundamental to the nature or essence of the object and are not dependent on external factors.</li>\n<li>Swabhavik gunas are considered to be enduring and permanent characteristics of an object.</li>\n<li>For example, qualities like hardness in a diamond, liquidity in water, or transparency in glass are considered swabhavik gunas because they are inherent to these substances and remain consistent under normal conditions.</li>\n</ul>\n</li>\n<li>\n<p><strong>Agantuk Guna (Transient or Acquired Properties)</strong>:</p>\n<ul>\n<li>Agantuk guna refers to temporary or acquired properties that are not intrinsic to the object's nature but are acquired due to external influences or conditions.</li>\n<li>These qualities are not inherent to the object and can change or disappear under different circumstances.</li>\n<li>Agantuk gunas are often dependent on external factors or interactions with other objects.</li>\n<li>For example, the hotness of water when heated by fire is an agantuk guna because it is a temporary property acquired due to the influence of fire. Once the water cools down, its hotness diminishes, indicating the transient nature of this property.</li>\n</ul>\n</li>\n</ol>",
            "author": {
                "name": "Seeker"
            },
            "tags": [
            ],
            "date_published": "2024-04-21T21:22:09+05:30",
            "date_modified": "2024-04-21T21:25:35+05:30"
        },
        {
            "id": "https://advaitavedanta.github.io/jeeva-body-not-gets-vanished-after-gnyana.html",
            "url": "https://advaitavedanta.github.io/jeeva-body-not-gets-vanished-after-gnyana.html",
            "title": "Jeeva body not gets vanished after gnyana",
            "summary": "The body is created by ishwara and it should be allowed to run its course. If it's created by jeeva, it wil go away with the knowledge. Just like rope-snake that will disappear with the wake knowledge of the rope. The snake is arthaadhyaasa, error&hellip;",
            "content_html": "<p><em>The body is created by ishwara and it should be allowed to run its course. If it's created by jeeva, it wil go away with the knowledge. Just like rope-snake that will disappear with the wake knowledge of the rope. The snake is <strong>arthaadhyaasa</strong>, error of object. The body which is ishwara's creation is <strong>gyaanaadhyaasa</strong>, error of knowledge. (Even after knowing sun does not move, sun will be seen rising and setting). Similarly physical body will continue to exist till prarabdha lasts. When we say body is ishwara's creation it is not given by him according to his whims and fancies but <strong>in keeping with the law of karma</strong>.<br><br>Explaination - <br><br></em></p>\n<p>The concept is explained that even after attaining spiritual enlightenment or \"gnyana,\" the physical body of an individual, known as the \"jeeva\" body, does not disappear immediately. This is elucidated through the analogy of the rope and the snake.</p>\n<ol>\n<li>\n<p>Creation by Ishwara: According to Vedanta, the physical body is created by Ishwara, the divine aspect of existence. It is viewed as part of the cosmic order and is governed by the laws of karma. Therefore, the body should be allowed to naturally run its course until the end of its predetermined lifespan, known as \"<strong>prarabdha</strong>.\"</p>\n</li>\n<li>\n<p><strong>Gyanaadhyaasa </strong>and <strong>Arthaadhyaasa</strong>: The persistence of the body even after attaining spiritual enlightenment is explained through the concepts of \"gyanaadhyaasa\" and \"arthaadhyaasa.\" \"Arthaadhyaasa\" refers to the error of object perception, as in mistaking a rope for a snake. In contrast, \"gyanaadhyaasa\" refers to the error of knowledge, where despite knowing the truth, the perception or experience remains unchanged.</p>\n</li>\n<li>\n<p>Example of the Rope-Snake Analogy: Just as the illusion of the snake persists even after realizing the rope's true nature, the physical body continues to exist even after gaining spiritual knowledge. The disappearance of the snake upon realizing the rope represents the resolution of the error of object perception. Similarly, the physical body's existence is seen as a manifestation of the divine order, which continues until the individual's predetermined karma is exhausted.</p>\n</li>\n<li>\n<p>Law of Karma: The creation of the body by Ishwara is not arbitrary but follows the law of karma. Each individual's experiences, including the physical body, are shaped by past actions and karmic debts. Therefore, the body's existence is governed by laws rather than divine whim.</p>\n</li>\n</ol>\n<p><em> </em></p>",
            "author": {
                "name": "Seeker"
            },
            "tags": [
            ],
            "date_published": "2024-04-21T21:16:01+05:30",
            "date_modified": "2024-04-21T21:16:01+05:30"
        },
        {
            "id": "https://advaitavedanta.github.io/upadhi-upahitam.html",
            "url": "https://advaitavedanta.github.io/upadhi-upahitam.html",
            "title": "upAdhi / upAhitam",
            "summary": "\"Upaadhi Upaahitam\" is a term used in Vedanta to describe a phenomenon where attributes of one entity appear to be present in another due to their close association or proximity. Upaadhi: The term \"Upaadhi\" refers to a limiting adjunct or condition that affects or influences&hellip;",
            "content_html": "<p>\"Upaadhi Upaahitam\" is a term used in Vedanta to describe a phenomenon where attributes of one entity appear to be present in another due to their close association or proximity.</p>\n<ol>\n<li>\n<p>Upaadhi: The term \"Upaadhi\" refers to a limiting adjunct or condition that affects or influences something else. In this context, it can represent the mind or any other limited aspect of individual experience.</p>\n</li>\n<li>\n<p>Upaahitam: \"Upaahitam\" refers to that which is influenced or affected by the Upaadhi. In this context, it represents consciousness or the underlying substratum of reality.</p>\n</li>\n</ol>\n<p>When we say \"Upaadhi Upaahitam,\" we're describing a situation where the attributes or characteristics of one entity (the Upaadhi) seem to be transferred or projected onto another (the Upaahitam) due to their close association.</p>\n<p>For example, when the mind (Upaadhi) is closely associated with consciousness (Upaahitam), the limitations or qualities of the mind may appear to affect consciousness. This can create the illusion that consciousness is limited or conditioned by the attributes of the mind, such as thoughts, emotions, or perceptions.</p>\n<p>However, from the perspective of Vedanta, consciousness itself is unaffected by the attributes of the mind. It remains inherently limitless and unaffected by any conditioning. The apparent influence of the mind on consciousness is seen as a result of their close association or proximity, rather than any intrinsic property of consciousness itself.</p>\n<p>In summary, \"Upaadhi Upaahitam\" describes the phenomenon where attributes of one entity seem to affect another due to their close association, highlighting the importance of discerning/ identifying the true nature of reality beyond apparent limitations or conditioning.</p>",
            "author": {
                "name": "Seeker"
            },
            "tags": [
            ],
            "date_published": "2024-04-21T21:08:57+05:30",
            "date_modified": "2024-04-21T21:10:13+05:30"
        },
        {
            "id": "https://advaitavedanta.github.io/chitrapata-nyaya.html",
            "url": "https://advaitavedanta.github.io/chitrapata-nyaya.html",
            "title": "Chitrapata Nyaya",
            "summary": "\"Chitrapata Nyaya\" is an analogy used in Vedanta, to illustrate the concept of Maya, the illusion of the world. In this analogy, the example given is of a cloth with various designs like mountains, sun, etc., woven into it. However, upon closer examination, one realizes&hellip;",
            "content_html": "<p>\"Chitrapata Nyaya\" is an analogy used in Vedanta, to illustrate the concept of Maya, the illusion of the world.<br><br>In this analogy, the example given is of a cloth with various designs like mountains, sun, etc., woven into it. However, upon closer examination, one realizes that the cloth is made up only of threads arranged in a particular manner (long threads and cross threads). If one were to pull a single thread, the entire cloth would unravel, and what remains is just a ball of thread. The mountains, sun, and other designs were never inherent in the cloth itself; they were merely woven into it. In reality, only the threads exist.<br><br>Similarly, according to this analogy, the world as we perceive it—earth, sky, mountains, sun, and all other objects—is like the designs on the cloth. These are merely names and forms woven into the fabric of consciousness. When we delve deeper into the nature of reality, we realize that these forms are not inherent in the underlying substrate but are superimposed upon it. Just as pulling a thread reveals the true nature of the cloth, the realization of the underlying consciousness unveils the true nature of reality, where names and forms dissolve, leaving only the essence of existence.<br><br></p>\n<p><em><span style=\"font-weight: 400;\">Kapde par suraj pahaad wagera banaa hua hai.. but kapda actual me sirf threads ka (ot = long thread prot= cross thread)</span><strong>  </strong><span style=\"font-weight: 400;\">arrangement he hai.. agar ek thread pakad ke kheech Diya to poora kapdaa udhad jaayega aur udhade huwe dhaage ka golaa banaa ke side me rakh do.. ab wo suraj pahaad bhi jo kapde ke bane huwe they gayab hogaye. Na suraj tha na pahaad aur na he kapda… thread alone was reality<br></span></em><em><span style=\"font-weight: 400;\">Similarly earth sky etc are name and form woven into consciousness </span></em></p>",
            "author": {
                "name": "Seeker"
            },
            "tags": [
            ],
            "date_published": "2024-04-21T21:06:21+05:30",
            "date_modified": "2024-04-21T21:06:21+05:30"
        },
        {
            "id": "https://advaitavedanta.github.io/abhidhaana-and-abhidheya.html",
            "url": "https://advaitavedanta.github.io/abhidhaana-and-abhidheya.html",
            "title": "Abhidhaana &amp; Abhidheya",
            "summary": "In Vedanta, the terms \"abhidhaana\" and \"abhidheya\" refer to fundamental concepts concerning language and its relationship to reality. Abhidhaana (the word): Abhidhaana represents the word itself, the linguistic sign or symbol that is used to convey meaning. It's the spoken or written form of language,&hellip;",
            "content_html": "<p>In Vedanta, the terms \"abhidhaana\" and \"abhidheya\" refer to fundamental concepts concerning language and its relationship to reality.<br><br><strong>Abhidhaana </strong>(the word): Abhidhaana represents the word itself, the linguistic sign or symbol that is used to convey meaning. It's the spoken or written form of language, such as individual words, phrases, or sentences. Abhidhaana is the medium through which communication takes place, enabling us to express ideas, concepts, and experiences.<br><br><strong>Abhidheya </strong>(the object revealed by the word): Abhidheya refers to the object or meaning conveyed by the word. It's what the word signifies or represents in the mind of the speaker or listener. When we use language, the intention is to convey certain meanings or concepts through words. These meanings or concepts are the abhidheya. They can range from concrete objects and qualities to abstract ideas and philosophical principles.<br>In summary, abhidhaana is the word itself, while abhidheya is the object or meaning conveyed by the word. </p>",
            "author": {
                "name": "Seeker"
            },
            "tags": [
            ],
            "date_published": "2024-04-21T21:03:00+05:30",
            "date_modified": "2024-04-21T21:03:00+05:30"
        },
        {
            "id": "https://advaitavedanta.github.io/limitation-of-vaga.html",
            "url": "https://advaitavedanta.github.io/limitation-of-vaga.html",
            "title": "Limitation of Vaga",
            "summary": "Limitation of words, or \"Vaga,\" refers to the constraints of language in expressing certain aspects of reality. Words are powerful tools for communication, but they have their limitations. Adi Shankara says words can only reveal four specific aspects: Jaati: This refers to the classification or&hellip;",
            "content_html": "<p><br>Limitation of words, or \"Vaga,\" refers to the constraints of language in expressing certain aspects of reality. Words are powerful tools for communication, but they have their limitations. Adi Shankara says words can only reveal four specific aspects:<br><br><strong>Jaati</strong>: This refers to the classification or category of a thing. Words can label or classify objects based on their type or category. For example, words can distinguish between different species of animals or types of objects.<br><strong>Guna</strong>: Guna refers to the qualities or attributes of a thing. Words can describe the characteristics or properties of objects, such as their color, size, shape, or texture. By using words, we can convey information about the qualities of things.<br><strong>Kriya</strong>: Kriya pertains to the actions or activities associated with a thing. Words can describe the actions performed by objects or individuals. They can convey information about what something does or how it behaves.<br><strong>Sambandha</strong>: Sambandha refers to the relationship or connection between things. Words can describe the relationships between objects or entities, such as cause and effect, association, or dependency. They can convey information about how things are related to each other.<br>\"<strong>sangya</strong>,\" which refers to the naming or identification of objects, is closely related to \"jaati\" (classification), as it involves categorizing objects by assigning them names or labels. By naming objects, we establish their identity and distinguish them from others, which is an essential function of language. </p>",
            "author": {
                "name": "Seeker"
            },
            "tags": [
            ],
            "date_published": "2024-04-21T20:58:57+05:30",
            "date_modified": "2024-04-21T20:58:57+05:30"
        },
        {
            "id": "https://advaitavedanta.github.io/samaanaadhikaranya.html",
            "url": "https://advaitavedanta.github.io/samaanaadhikaranya.html",
            "title": "Samaanaadhikaranya ",
            "summary": "Sarvam khalu idam brahm. Words idam and sarvam are in samaanaadhikaranya, in apposition, revealing the same object. Devadatta is a grammarian, where devadatta and grammarian are in samaanaadhikaranya, revealing one and same person. Suppose a person mistakes a rope for a snake, he is told&hellip;",
            "content_html": "<p><em>Sarvam khalu idam brahm. Words idam and sarvam are in samaanaadhikaranya, in apposition, revealing the same object. Devadatta is a grammarian, where devadatta and grammarian are in samaanaadhikaranya, revealing one and same person. </em><br><em>Suppose a person mistakes a rope for a snake, he is told that it is not a snake but a rope. One word (snake) negates itself and reveals the other. This is \"badhyam samaanaadhikaranya\". </em><br><em>Idam sarvam brahm - idam sarvam is negated - this is to be understood as badhyam samaanaadhikaranya. <strong> mundak upanishad part 2, page २२</strong></em><br><br>Explaination: </p>\n<div class=\"flex-1 overflow-hidden\">\n<div class=\"react-scroll-to-bottom--css-iystm-79elbk h-full\">\n<div class=\"react-scroll-to-bottom--css-iystm-1n7m0yu\">\n<div>\n<div class=\"flex flex-col text-sm pb-9\">\n<div class=\"w-full text-token-text-primary\" dir=\"auto\" data-testid=\"conversation-turn-23\">\n<div class=\"px-4 py-2 justify-center text-base md:gap-6 m-auto\">\n<div class=\"flex flex-1 text-base mx-auto gap-3 juice:gap-4 juice:md:gap-6 md:px-5 lg:px-1 xl:px-5 md:max-w-3xl lg:max-w-[40rem] xl:max-w-[48rem]\">\n<div class=\"relative flex w-full flex-col agent-turn\">\n<div class=\"flex-col gap-1 md:gap-3\">\n<div class=\"flex flex-grow flex-col max-w-full\">\n<div class=\"min-h-[20px] text-message flex flex-col items-start gap-3 whitespace-pre-wrap break-words [.text-message+&amp;]:mt-5 overflow-x-auto\" dir=\"auto\" data-message-author-role=\"assistant\" data-message-id=\"d2ae43c6-4e31-4ff3-864d-4a7391f13639\">\n<div class=\"markdown prose w-full break-words dark:prose-invert light\">\n<p>\"Sarvam khalu idam brahm\" expresses the Vedantic concept that everything is indeed Brahman. Here, \"idam\" (this) and \"sarvam\" (everything) are in \"samaanaadhikaranya,\" a grammatical term indicating they refer to the same object. It's similar to saying \"Devadatta is a grammarian,\" where \"Devadatta\" and \"grammarian\" point to the same person.</p>\n<p>In the example of mistaking a rope for a snake, when corrected, the word \"snake\" negates itself and reveals the truth of the object as a rope. This is termed \"badhyam samaanaadhikaranya,\" where one word negates itself and points to another.</p>\n<p>Applying this to \"idam sarvam brahm,\" the phrase \"idam sarvam\" (all this) is negated, indicating that everything is Brahman. This negation operates similarly to the snake being negated to reveal the rope. It's a way of understanding that all that is perceived ultimately points to the singular reality of Brahman.</p>\n</div>\n</div>\n</div>\n<div class=\"mt-1 flex gap-3 empty:hidden\">\n<div class=\"text-gray-400 flex self-end lg:self-center items-center justify-center lg:justify-start mt-0 -ml-1 h-7 gap-[2px] visible\"><button class=\"flex items-center gap-1.5 rounded-md p-1 text-xs text-token-text-tertiary hover:text-token-text-primary\"><svg width=\"24\" height=\"24\" viewbox=\"0 0 24 24\" fill=\"none\" xmlns=\"http://www.w3.org/2000/svg\" class=\"icon-md\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M11 4.9099C11 4.47485 10.4828 4.24734 10.1621 4.54132L6.67572 7.7372C6.49129 7.90626 6.25019 8.00005 6 8.00005H4C3.44772 8.00005 3 8.44776 3 9.00005V15C3 15.5523 3.44772 16 4 16H6C6.25019 16 6.49129 16.0938 6.67572 16.2629L10.1621 19.4588C10.4828 19.7527 11 19.5252 11 19.0902V4.9099ZM8.81069 3.06701C10.4142 1.59714 13 2.73463 13 4.9099V19.0902C13 21.2655 10.4142 22.403 8.81069 20.9331L5.61102 18H4C2.34315 18 1 16.6569 1 15V9.00005C1 7.34319 2.34315 6.00005 4 6.00005H5.61102L8.81069 3.06701ZM20.3166 6.35665C20.8019 6.09313 21.409 6.27296 21.6725 6.75833C22.5191 8.3176 22.9996 10.1042 22.9996 12.0001C22.9996 13.8507 22.5418 15.5974 21.7323 17.1302C21.4744 17.6185 20.8695 17.8054 20.3811 17.5475C19.8927 17.2896 19.7059 16.6846 19.9638 16.1962C20.6249 14.9444 20.9996 13.5175 20.9996 12.0001C20.9996 10.4458 20.6064 8.98627 19.9149 7.71262C19.6514 7.22726 19.8312 6.62017 20.3166 6.35665ZM15.7994 7.90049C16.241 7.5688 16.8679 7.65789 17.1995 8.09947C18.0156 9.18593 18.4996 10.5379 18.4996 12.0001C18.4996 13.3127 18.1094 14.5372 17.4385 15.5604C17.1357 16.0222 16.5158 16.1511 16.0539 15.8483C15.5921 15.5455 15.4632 14.9255 15.766 14.4637C16.2298 13.7564 16.4996 12.9113 16.4996 12.0001C16.4996 10.9859 16.1653 10.0526 15.6004 9.30063C15.2687 8.85905 15.3578 8.23218 15.7994 7.90049Z\" fill=\"currentColor\"></path></svg></button><button class=\"flex items-center gap-1.5 rounded-md p-1 text-xs text-token-text-tertiary hover:text-token-text-primary\"><svg width=\"24\" height=\"24\" viewbox=\"0 0 24 24\" fill=\"none\" xmlns=\"http://www.w3.org/2000/svg\" class=\"icon-md\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M12 3.5C10.8954 3.5 10 4.39543 10 5.5H14C14 4.39543 13.1046 3.5 12 3.5ZM8.53513 3.5C9.22675 2.3044 10.5194 1.5 12 1.5C13.4806 1.5 14.7733 2.3044 15.4649 3.5H17.25C18.9069 3.5 20.25 4.84315 20.25 6.5V18.5C20.25 20.1569 19.1569 21.5 17.25 21.5H6.75C5.09315 21.5 3.75 20.1569 3.75 18.5V6.5C3.75 4.84315 5.09315 3.5 6.75 3.5H8.53513ZM8 5.5H6.75C6.19772 5.5 5.75 5.94772 5.75 6.5V18.5C5.75 19.0523 6.19772 19.5 6.75 19.5H17.25C18.0523 19.5 18.25 19.0523 18.25 18.5V6.5C18.25 5.94772 17.8023 5.5 17.25 5.5H16C16 6.60457 15.1046 7.5 14 7.5H10C8.89543 7.5 8 6.60457 8 5.5Z\" fill=\"currentColor\"></path></svg></button>\n<div class=\"flex items-center gap-1.5 text-xs\"> </div>\n<div class=\"flex\"> </div>\n</div>\n</div>\n<div class=\"pr-2 lg:pr-0\"> </div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<div class=\"w-full pt-2 md:pt-0 dark:border-white/20 md:border-transparent md:dark:border-transparent md:w-[calc(100%-.5rem)]\"><form class=\"stretch mx-2 flex flex-row gap-3 last:mb-2 md:mx-4 md:last:mb-6 lg:mx-auto lg:max-w-2xl xl:max-w-3xl\">\n<div class=\"relative flex h-full flex-1 flex-col\">\n<div class=\"absolute bottom-full left-0 right-0\"> </div>\n<div class=\"flex w-full items-center\"> </div>\n</div>\n</form></div>",
            "author": {
                "name": "Seeker"
            },
            "tags": [
            ],
            "date_published": "2024-04-21T20:52:54+05:30",
            "date_modified": "2024-04-21T20:52:54+05:30"
        }
    ]
}
